using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Kursova.Models
{
    internal class List
    {
        public List<string> GetHairColors()
        {
            return new List<string>
        {
            "Чорний",
            "Каштановий",
            "Блонд",
            "Рудий",
            "Червоний",
            "Помаранчевий",
            "Жовтий",
            "Зелений",
            "Синій",
            "Фіолетовий",
            "Інший"
            };
        }

        public List<string> GetEyeColors()
        {
            return new List<string>
        {
            "Карий",
            "Горіховий",
            "Зелений",
            "Сірий",
            "Блакитний",
            "Синій",
            "Червоний",
            "Гетерохромія",
            "Інший"
            };
        }

        public List<string> GetCountries()
        {
            return new List<string>
            {
            "Австралія", "Австрія", "Азербайджан", "Албанія", "Алжир", "Ангола", "Андорра", "Антигуа і Барбуда", "Аргентина",
            "Афганістан", "Багамські острови", "Бангладеш", "Барбадос", "Бахрейн", "Беліз", "Бельгія", "Бенін", "Білорусь",
            "Болгарія", "Болівія", "Боснія і Герцеговина", "Ботсвана", "Бразилія", "Бруней", "Буркіна-Фасо", "Бурунді",
            "Бутан", "Вануату", "Ватикан", "Велика Британія", "Венесуела", "В'єтнам", "Вірменія", "Габон", "Гаїті", "Гаяна",
            "Гамбія", "Гана", "Гватемала", "Гвінея", "Гвінея-Бісау", "Гондурас", "Гренада", "Греція", "Грузія", "Данія",
            "Джибуті", "Домініка", "Домініканська Республіка", "Еквадор", "Екваторіальна Гвінея", "Ель-Сальвадор", "Еритрея",
            "Естонія", "Есватіні", "Ефіопія", "Єгипет", "Ємен", "Замбія", "Західна Сахара", "Зімбабве", "Ізраїль", "Індія",
            "Індонезія", "Ірак", "Іран", "Ірландія", "Ісландія", "Іспанія", "Італія", "Йорданія", "Кабо-Верде", "Казахстан",
            "Камбоджа", "Камерун", "Канада", "Катар", "Кенія", "Киргизстан", "Китай", "Кіпр", "Кірибаті", "Колумбія",
            "Коморські острови", "Конго", "Демократична Республіка Конго", "Коста-Рика", "Кот-д'Івуар", "Куба", "Кувейт",
            "Лаос", "Латвія", "Лесото", "Ліван", "Лівія", "Литва", "Ліхтенштейн", "Люксембург", "Маврикій", "Мавританія",
            "Мадагаскар", "Малаві", "Малайзія", "Малі", "Мальдіви", "Мальта", "Марокко", "Маршаллові острови", "Мексика",
            "Мозамбік", "Молдова", "Монако", "Монголія", "М'янма", "Намібія", "Науру", "Непал", "Нігер", "Нігерія",
            "Нідерланди", "Нікарагуа", "Німеччина", "Нова Зеландія", "Норвегія", "Об'єднані Арабські Емірати", "Оман",
            "Пакистан", "Палау", "Палестина", "Панама", "Папуа Нова Гвінея", "Парагвай", "Перу", "Південна Корея",
            "Південний Судан", "Північна Корея", "Північна Македонія", "Польща", "Португалія", "Росія", "Руанда", "Румунія",
            "Сальвадор", "Самоа", "Сан-Марино", "Сан-Томе і Принсіпі", "Саудівська Аравія", "Сейшельські острови", "Сенегал",
            "Сент-Вінсент і Гренадини", "Сент-Кітс і Невіс", "Сент-Люсія", "Сербія", "Сінгапур", "Сирія", "Словаччина",
            "Словенія", "Соломонові острови", "Сомалі", "Судан", "Суринам", "Східний Тимор", "США", "Сьєрра-Леоне", "Таджикистан",
            "Таїланд", "Танзанія", "Того", "Тонга", "Тринідад і Тобаго", "Тувалу", "Туніс", "Туреччина", "Туркменістан",
            "Уганда", "Угорщина", "Узбекистан", "Україна", "Уругвай", "Фіджі", "Філіппіни", "Фінляндія", "Франція",
            "Хорватія", "Центральноафриканська Республіка", "Чад", "Чехія", "Чилі", "Чорногорія", "Швейцарія", "Швеція",
            "Шрі-Ланка", "Ямайка", "Японія"
            };
        }

        public List<string> GetLanguages()
        {
            return new List<string>
            {
            "Англійська", "Арабська", "Азербайджанська", "Албанська", "Амхарська", "Африкаанс",
            "Баскська", "Бенгальська", "Білоруська", "Болгарська", "Боснійська", "Бірманська",
            "Валлійська", "В'єтнамська", "Вірменська",
            "Галісійська", "Гаитянська Креольська", "Гінді", "Голландська", "Грецька", "Грузинська", "Гуджараті",
            "Данська",
            "Есперанто", "Естонська",
            "Іврит", "Ігбо", "Індонезійська", "Ірландська", "Ісландська", "Іспанська", "Італійська",
            "Казахська", "Каннада", "Каталонська", "Кечуа", "Киргизька", "Китайська", "Кхмерська", "Кореяська", "Корсиканська", "Ксоза", "Курдська",
            "Лаоська", "Латвійська", "Латинська", "Литовська", "Люксембурзька",
            "Македонська", "Малагасійська", "Малайська", "Малаялам", "Мальтійська", "Маратхі", "Маорі", "Монголська",
            "Непальська", "Німецька", "Норвезька",
            "Панджабі", "Перська", "Польська", "Португальська", "Пушту",
            "Російська", "Румунська",
            "Самоанська", "Себуанська", "Сербська", "Сингальська", "Сіндхі", "Словацька", "Словенська", "Сомалійська", "Суахілі", "Суданська", "Суахілі", "Себуанська", "Словенська", "Словацька", "Сомалійська", "Суахілі", "Суданська", "Шона",
            "Таджицька", "Таїльська", "Тамільська", "Татарська", "Телугу", "Турецька", "Туркменська",
            "Угорська", "Урду", "Узбецька", "Українська",
            "Фарерська", "Фіджійська", "Філіппінська", "Фінська", "Французька",
            "Хауса", "Хорватська",
            "Чеська", "Чеченська",
            "Шведська",
            "Яванська", "Японська", "Їдиш", "Йоруба", "Зулу"
            };
        }

        public List<string> GetCriminalProfession()
        {
            return new List<string>
            {
            "Аферист",
            "Бандит",
            "Вбивця",
            "Викрадач",
            "Вимагатель",
            "Грабіжник",
            "Диверсант",
            "Дилер",
            "Злодій",
            "Хакер",
            "Контрабандист",
            "Крадій",
            "Корупціонер",
            "Наркокур'єр",
            "Наркоторговець",
            "Палій",
            "Пірат",
            "Похитник",
            "Рецидивіст",
            "Рекетир",
            "Снайпер",
            "Сутенер",
            "Шантажист",
            "Шахрай",
            "Шпигун",
            "Угонщик",
            "Фальшивомонетник"
            };
        }
    }
}
